_org_posts/_posts/2021-01-02-boj-2138.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: BOJ 2138 전구와 스위치
#+HTML: tags: 그리디
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 2138 전구와 스위치
- N개의 스위치로 N개의 전구의 on/off상태를 조정해서 목적 state로 갈 수 있는지 확인
- 스위치를 최소 몇번 눌러야 하나

** 접근하기
#+BEGIN_EXAMPLE
1. 맨처음 상태를 누르지 않고 시작
   -> cnt = 0;
   -> for(int i=1 ...) 모두 진행하기

2. 맨처음 상태를 누르고 시작 (0번을 누르면, 1번도 같이 눌림, -1번은 없으니 무시)
   -> cnt = 1
   -> a[-1] ^= 1;   // -1은 범위가 아님 제외
   -> a[0] ^= 1;
   -> a[1] ^= 1;
   -> for(int i=1 ...) 모두 진행하기

case 1만 성공 -> 1cnt 출력
case 2만 성공 -> 2cnt 출력
둘다 성공     -> min(1cnt, 2cnt)
둘다 실패     -> -1출력
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;

int N;

char astr[100010];
int a0[100010];
int a1[100010];

char bstr[100010];
int b0[100010];

int main(int argc, char* argv[])
{
    freopen("input.txt", "r", stdin);
    scanf("%d", &N);
    scanf("%s", astr);    
    scanf("%s", bstr);    

    int i;
    for(i=0;i<N;i++) {
        a0[i] = astr[i] - '0';
        a1[i] = astr[i] - '0';

        b0[i] = bstr[i] - '0';
    }

    // a0
    // 0번 스위치 누름
    a0[0] ^= 1;
    a0[1] ^= 1;
    // 누름이므로 1로 시작
    int a0cnt = 1;
    for(int i=1;i<N;i++) {
        if (a0[i-1] != b0[i-1]) {
            if (i-1 >= 0) a0[i-1] ^= 1;
            a0[i] ^= 1;
            if (i+1 < N) a0[i+1] ^= 1;
            a0cnt += 1;
        }
    }    

    // a1
    int a1cnt = 0;
    for(int i=1;i<N;i++) {
        if (a1[i-1] != b0[i-1]) {
            if (i-1 >= 0) a1[i-1] ^= 1;
            a1[i] ^= 1;
            if (i+1 < N) a1[i+1] ^= 1;
            a1cnt += 1;
        }
    }    
    
    bool same0 = true;
    for(int i=0;i<N;i++) {
        if (a0[i] != b0[i]) {
            same0 = false;
            break;
        } 
    }

    bool same1 = true;
    for(int i=0;i<N;i++) {
        if (a1[i] != b0[i]) {
            same1 = false;
            break;
        } 
    }
    if (!same0 && !same1) {
        printf("-1\n");
    } else if (same0 && !same1) {
        printf("%d\n", a0cnt);
    } else if (same1 && !same0) {
        printf("%d\n", a1cnt);
    } else {
        printf("%d\n", min(a0cnt, a1cnt));
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/2138
