_posts/2021-01-02-boj-2138.html
---
layout: post
title: BOJ 2138 전구와 스위치
tags: 그리디
---

<div id="outline-container-orgb355064" class="outline-2">
<h2 id="orgb355064">BOJ 2138 전구와 스위치</h2>
<div class="outline-text-2" id="text-orgb355064">
<ul class="org-ul">
<li>N개의 스위치로 N개의 전구의 on/off상태를 조정해서 목적 state로 갈 수 있는지 확인</li>
<li>스위치를 최소 몇번 눌러야 하나</li>
</ul>
</div>
</div>
<div id="outline-container-orga98a6b2" class="outline-2">
<h2 id="orga98a6b2">접근하기</h2>
<div class="outline-text-2" id="text-orga98a6b2">
<pre class="example">
1. 맨처음 상태를 누르지 않고 시작
   -&gt; cnt = 0;
   -&gt; for(int i=1 ...) 모두 진행하기

2. 맨처음 상태를 누르고 시작 (0번을 누르면, 1번도 같이 눌림, -1번은 없으니 무시)
   -&gt; cnt = 1
   -&gt; a[-1] ^= 1;   // -1은 범위가 아님 제외
   -&gt; a[0] ^= 1;
   -&gt; a[1] ^= 1;
   -&gt; for(int i=1 ...) 모두 진행하기

case 1만 성공 -&gt; 1cnt 출력
case 2만 성공 -&gt; 2cnt 출력
둘다 성공     -&gt; min(1cnt, 2cnt)
둘다 실패     -&gt; -1출력
</pre>
</div>
</div>

<div id="outline-container-orgb8f5aab" class="outline-2">
<h2 id="orgb8f5aab">코드</h2>
<div class="outline-text-2" id="text-orgb8f5aab">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">astr</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a0</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a1</span>[100010];

<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">bstr</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b0</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, astr);    
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, bstr);    

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(i=0;i&lt;N;i++) {
        a0[i] = astr[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>;
        a1[i] = astr[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>;

        b0[i] = bstr[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>;
    }

    <span style="color: #888a85;">// </span><span style="color: #888a85;">a0</span>
    <span style="color: #888a85;">// </span><span style="color: #888a85;">0&#48264; &#49828;&#50948;&#52824; &#45572;&#47492;</span>
    a0[0] ^= 1;
    a0[1] ^= 1;
    <span style="color: #888a85;">// </span><span style="color: #888a85;">&#45572;&#47492;&#51060;&#48064;&#47196; 1&#47196; &#49884;&#51089;</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a0cnt</span> = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (a0[i-1] != b0[i-1]) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (i-1 &gt;= 0) a0[i-1] ^= 1;
            a0[i] ^= 1;
            <span style="color: #729fcf; font-weight: bold;">if</span> (i+1 &lt; N) a0[i+1] ^= 1;
            a0cnt += 1;
        }
    }    

    <span style="color: #888a85;">// </span><span style="color: #888a85;">a1</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a1cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (a1[i-1] != b0[i-1]) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (i-1 &gt;= 0) a1[i-1] ^= 1;
            a1[i] ^= 1;
            <span style="color: #729fcf; font-weight: bold;">if</span> (i+1 &lt; N) a1[i+1] ^= 1;
            a1cnt += 1;
        }
    }    

    <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">same0</span> = <span style="color: #8ae234;">true</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (a0[i] != b0[i]) {
            same0 = <span style="color: #8ae234;">false</span>;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        } 
    }

    <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">same1</span> = <span style="color: #8ae234;">true</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (a1[i] != b0[i]) {
            same1 = <span style="color: #8ae234;">false</span>;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        } 
    }
    <span style="color: #729fcf; font-weight: bold;">if</span> (!same0 &amp;&amp; !same1) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"-1\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (same0 &amp;&amp; !same1) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, a0cnt);
    } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (same1 &amp;&amp; !same0) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, a1cnt);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, min(a0cnt, a1cnt));
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org272164e" class="outline-2">
<h2 id="org272164e">문제 링크</h2>
<div class="outline-text-2" id="text-org272164e">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2138">https://www.acmicpc.net/problem/2138</a></li>
</ul>
</div>
</div>
